<template>
  <div>
    <!-- 顶部导航开始 -->
    <div class="header">
      <mt-header title="充值协议" fixed>
        <router-link slot="left" to="/recharge">
          <mt-button icon="back"></mt-button>
        </router-link>
      </mt-header>
    </div>
    <!-- 顶部导航结束 -->
    <!-- 充值须知文本开始 -->
    <div class="content">
      <p>尊敬的用户，为保障您的合法杈益，请您在点击”去充值"按钮前，完整、仔细地阅读本充值协议。当您继续点击"充值"按钮，即视为您已阅读、理解本协议，并同意按本协议规定执行。</p>
      <p>您同意迅达小时工有权随时修改本协议，并以微信小程序公示的方式通知您，修改后的协议自公示时生效。本协议的条款修改后，如果您不同意本协议条款的修改,可以停止继续使用同城小时工充值服务，如果您继续使用同城小时工充值服务,则视为已经接受本协议的全部修改。</p>
      <p>1、充值方式目前仅支持通过微信在线充值，尚不支持其他平台的充值方式，所以在充值过程中，请注意认准迅达小时工充值唯一方式。</p>
      <p>2、充值赠返金额(如有&gt;、充值金额、账户金额.充值赠送金额指:根据本小程序不时推出的充值优惠活动，您充值后，在您充值金额以外,额外赠予的金额。如，您充值1000元人民币，根据当时的充值优惠活动赠送您100元，则您成功充值1000元后，在本小程序账户内显示的充值金额为1100元，超出的100元即为充值赠送金额。充值金额指:您实际充值支付的金额(人民币&gt;、账户金额:即您小程序账户中当前显示的金额，账户金额一般通过充值金额、充值赠送金额及其他赠送或补偿的金额获得。</p>
      <p>3、充值后，充值赠送金额(如有>将立即累加到您的账户金额，充值赠送代金券(如有> 将立即发放至您的账户中。</p>
      <p>4、充值后，账户金额仅可用于支付本微信小程序提供的相关服务。</p>
      <p>5、充值后，账户金额使用不设有效期，可长期使用，不能提现、转移、转赠。</p>
      <p>6、用户使用账户金额支付的订单，如遇订单取消或者变更产生退款时，使用账户金额支付的款项将原路退回到账户余额。</p>
      <p>7、对本充值协议如有疑问，请务必在充值前拨打客服热线1527919687咨询。</p>
    </div>
    <!-- 充值须知文本结束 -->
  </div>
</template>
<style scoped>
.content {
  text-align: left;
  padding-top: 45px;
  line-height: 1.75;
}
.content p {
  padding: 0 5px;
}
</style>